//------------------Число N---------------------------------------------------------------------------------------------------------------------------------------

let n = +prompt ('Введіть перше число, будь ласка') ;

while (!Number.isInteger(n) || n <= 0) {
    alert ('Число має бути цілим! ')
    n = +prompt ('Введіть перше число знову, будь ласка') 
    
};

//--------------------------Число M-----------------------------------------------------------------------------------------------------------------

let m = +prompt ('Введіть друге число, будь ласка') ;
while (!Number.isInteger(m) || n > m) {
    alert ('Число має бути цілим! ')
    m = +prompt ('Введіть друге число знову, будь ласка') 
};

//-----------------------------------Парне чи непарне число?------------------------------------------------------------------------------------------------------------------

let skip_ever = confirm('Чи хочете ви пропустити парні числа?')
//-----------------------------------------------------------------------------------------------------------------------------------------

let result = 0;
for (let odd_number = n; odd_number <=m; odd_number++) {
    if (skip_ever) {
        if (!(odd_number % 2 === 0)){
            result = result + odd_number;}
    } else{result = result + odd_number}
}  
;
document.writeln('<h1>',`Привіт, Ваш результат:${result}`,'</h1>');